#+title: Segundo Examen de Programación Lineal
#+author: Licenciatura en Matemáticas Aplicadas, UAEH
#+date: 23 de abril de 2019
#+language: es

#+options: toc:nil

#+latex_header: \usepackage[margin=2.5cm]{geometry}
#+latex_header: \usepackage[spanish,mexico]{babel}
#+latex_header: \usepackage{tikz}

#+latex_class_options: [twocolumn]

#+latex: \thispagestyle{empty}

#+latex: \hrulefill

#+latex: \medskip

1. Resuelve el siguiente problema:
   \begin{equation*}
   \begin{aligned}
   \text{Maximizar} \quad & 2x+y\\
   \text{sujeto a} \quad &
     \begin{aligned}
      4x+y &\leq 150\\
      2x-3y &\leq -40\\
      x &\geq  0\\
      y &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}

Veremos cómo se resuelve este problema usando =pulp= de Python

#+begin_src ipython :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
prob = LpProblem("Problema1", LpMaximize)
prob += 4*x + y <= 150
prob += 2*x -3*y <= -40
prob += 2*x+y
prob
status = prob.solve()
value(x), value(y),value(prob.objective)
#+end_src

#+RESULTS:
| 0.0 | 150.0 | 150.0 |

2. Resuelve el siguiente problema:
   \begin{equation*}
    \begin{aligned}
   \text{Maximizar} \quad & 4x_{1}+2x_{2}\\
   \text{sujeto a} \quad &
     \begin{aligned}
      -2x_{1}+x_{2} &\leq 4\\
      x_{1}+2x_{2} &\geq 2\\
       x_{1} &\geq 0\\
       x_{2} &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}
#+begin_src ipython :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
prob = LpProblem("Problema2", LpMaximize)
prob += -2*x + y <= 4
prob += x +2*y >= 2
prob += 4*x+2*y
prob
status = prob.solve()
value(x), value(y),value(prob.objective)
#+end_src

#+RESULTS:
| 0.0 | 0.0 | 0.0 |

3. Resuelve el siguiente problema:
   \begin{equation*}
    \begin{aligned}
   \text{Maximizar} \quad & 5x_{1}+4x_{2}+3x_{3}\\
   \text{sujeto a} \quad &
     \begin{aligned}
      2x_{1}+3x_{2}+x_{3} &\leq 5\\
      4x_{1}+x_{2}+2x_{3} &\leq 11\\
      3x_{1}+4x_{2}+2x_{3} &\leq 8\\
       x_{1},x_{2},x_{3} &\geq 0
     \end{aligned}
   \end{aligned}
   \end{equation*}
#+begin_src ipython :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
z = LpVariable("z", 0)
prob = LpProblem("Problema3", LpMaximize)
prob += 2*x + 3*y + z <= 5
prob += 4*x + y + 2*z <= 11
prob += 3*x + 4*y + 2*z <=8
prob += 5*x+ 4*y+ 3*z
prob
status = prob.solve()
value(x), value(y),value(z),value(prob.objective)
#+end_src

#+RESULTS:
| 2.0 | 0.0 | 1.0 | 13.0 |

4. Considera el subconjunto convexo \(P\) de \(\mathbb{R}^{2}\)
   determinado por las desigualdades:
   \begin{equation}
      \label{uno}
     \begin{split}
      x+2y &\leq 4\\
       x,y &\geq 0
     \end{split}
   \end{equation}
   - Para cada vértice \(v\) de \(P\), encuentra un vector \(c\) tal
     que el problema de maximizar \(f(x)=c^{T}x\) en la región \(P\)
     encuentre su única solución en \(v\).
   - Encuentra todas las soluciones factibles básicas de la forma
     estándar de un problema de programación lineal determinado
     por \eqref{uno}. 
   - Si \(P'\subseteq \mathbb{R}^{3}\) es la región factible de un
     problema de programación lineal determinado por \eqref{uno}, para
     cada vértice \(v\) de \(P'\), encuentra un vector \(c\) tal que
     el problema de maximizar \(f(x)=c^{T}x\) en la región \(P'\)
     encuentre su única solución en \(v\).
5. Un fabricante produce dos tipos de ropa: \(T_{1}\) y
   \(T_{2}\). Para producir una unidad de \(T_{1}\) se necesitan 4
   unidades de la materia prima \(R1\), 5 unidaes de materia prima
   \(R2\) y una unidad de la materia prima \(R3\). Para producir una
   unidad de \(T_{2}\) los requerimientos, en el mismo orden, son 1, 3
   y 2 unidades, respectivamente. Las cantidades disponibles de \(R1,
   R2\) y \(R3\) son: 56, 105 y 56, respectivamente.
#+begin_src ipython :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
prob = LpProblem("Problema5", LpMaximize)
prob += 4*x + y <= 56
prob += 5*x +3*y <= 105
prob += x + 2*y <= 56
prob += 4*x+5*y
prob
status = prob.solve()
value(x), value(y),value(prob.objective)
#+end_src

#+RESULTS:
: # Out[1]:
: : (6.0, 25.0, 149.0)

   Si la ganancia de la venta de una unidad de \(T_{1}\) es de $4 y la
   de una unidad de \(T_{2}\) es $5, ¿cuánto se debe producir de
   \(T_{1}\) y \(T_{2}\) para maximizar las ganancias?
6. Una compañía que produce frutas mezcladas tiene en almacén 10,000
   kilos de peras, 12,000 kilos de duraznos y 8,000 kilos de
   cerezas. La compañía produce tres mezclas de frutas, que vende en
   latas de un kilo. La primera combinación contiene la mitad de peras
   y la mitad de duraznos. La segunda combinación contiene cantidades
   iguales de cada fruta. La tercera combinación tiene la mitad de
   duraznos y la mitad de cerezas. Las ganancias por lata vendida por
   cada combinación son de $3, $4 y $5 respectivamente. ¿Cuántas
   latas de cada combinación deberán producirse con el objeto de
   maximizar ganancias? ¿Cuál es la ganancia máxima?

#+begin_src ipython :session
from pulp import *
x = LpVariable("x", 0)
y = LpVariable("y", 0)
z = LpVariable("z", 0)
prob = LpProblem("Problema6", LpMaximize)
prob += 0.5*x +(1/3)*y <= 10000
prob += 0.5*x +(1/3)*y + 0.5*z <= 12000
prob += (1/3)*y + 0.5*z <=8000
prob += 3*x+ 4*y+ 5*z
prob
status = prob.solve()
value(x), value(y),value(z),value(prob.objective)
#+end_src

#+RESULTS:
: # Out[8]:
: : (8000.0, 18000.0, 4000.0, 116000.0)



# Local Variables:
# org-confirm-babel-evaluate: nil
# End:

